import 'package:flutter/material.dart';

class HistoryPag1 extends StatefulWidget {
  @override
  _HistoryPag1State createState() => _HistoryPag1State();
}

class _HistoryPag1State extends State<HistoryPag1> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        toolbarHeight: 40,
          backgroundColor: Colors.purple,
          leading: IconButton(
            onPressed: () {
              Navigator.of(context).pop();
            },
            icon: Icon(Icons.arrow_back),
          ),
          title: Text('ประวัติมหาวิทยาลัย')),
      body: Container(
        child: Column(
          children: <Widget>[
            Image.asset(
              'images/headp1.jpg',
              width: 900,
            ),
            Expanded(
              child: SingleChildScrollView(
                child: Column(
                  children: [
                    Container(
                      padding: EdgeInsets.all(20),
                      decoration: BoxDecoration(
                        color: Colors.purple[50],
                      ),
                      child: Column(
                        crossAxisAlignment: CrossAxisAlignment.start,
                        children: [
                          Text(
                            'ประวัติมหาวิทยาลัย',
                            style:
                                TextStyle(fontSize: 22.0, color: Colors.purple),
                          ),
                          SizedBox(height: 10),
                          Text(
                            '''\t\t\tสถาบันราชภัฏบ้านสมเด็จเจ้าพระยาเป็นสถานศึกษาที่ก่อตั้งมาครบ ๑๐๐ ปี ใน พ.ศ.๒๕๓๙ สถานศึกษาอันมีชื่อว่า “บ้านสมเด็จเจ้าพระยา” 

เกิดจากพระราชดำริของพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัวรัชกาลที่ ๕ ที่จะตั้งโรงเรียนแบบ public school ของอังกฤษโดยโปรดให้จัดตั้งคณะกรรมการเพื่อดำเนินการเรื่องนี้มีเจ้าพระยาภาสกรวงศ์เสนาบดีกระทรวงธรรมการเป็นประธาน ที่ประชุมเห็นว่าจวนของสมเด็จเจ้าพระยาบรมมหาศรีสุริยวงศ์ (ช่วง บุญนาค) ซึ่งพระยาสีหราชเดโชชัย หลานปู่ของสมเด็จเจ้าพระยาฯได้น้อมเกล้าฯ ถวายไว้ตั้งแต่ปี พ.ศ.๒๔๓๓ เป็นที่กว้างขวางใหญ่โตเห็นสมควรจัดตั้งเป็นโรงเรียน ''',
                            textAlign: TextAlign.justify,
                            style: TextStyle(),
                          ),
                          SizedBox(height: 10),
                          Text(
                            'โรงเรียนราชวิทยาลัย',
                            style:
                                TextStyle(fontSize: 22.0, color: Colors.purple),
                          ),
                          Text(
                            '''       ให้ชื่อว่า “โรงเรียนราชวิทยาลัย” เปิดเรียนตั้งแต่วันที่ ๑๗ มีนาคม ๒๔๓๙ แต่ชาวบ้านนิยมเรียกว่า “โรงเรียนฟากขะโน้น” หรือ “โรงเรียนานสมเด็จเจ้าพระยา” ตราของโรงเรียนเป็นรูป จุฬามงกุฏ การแต่งกายนุ่งผ้าสีครามแกสื้อขาว มีนาย เอ ซี คาร์เตอร์ เป็นอาจารย์ใหญ่ครั้นต่อมาการศึกษาขยายตัวขึ้นเป็นลำดับ ทำให้สถานที่คับแคบลงโรงเรียนราชวิทยาลัยจึงย้ายไปอยู่ที่ตำบลไผ่สิงโต ปทุมวัน ข้างวังสระปทุมวัน จวนของสมเด็จเจ้าพระยาฯ  ก็ว่างลงในขณะนั้นการศึกษาระหว่างหัวเมืองกับกรุงเทพมหานคร เหลื่อมล้ำกันมาก เนื่องจากคุณภาพของครูแตกต่างกัน กระทรวงธรรมการจึงได้จัดตั้งโรงเรียนฝึกหัดครูขึ้นที่จวนของสมเด็จเจ้าพระยาฯเรียกว่า “โรงเรียนฝึกหัดครูฝั่งตะวันตก” สำหรับผลิตครูที่มีคุณภาพเพื่อสอนในหัวเมือง เริ่มเปิดสอนเมื่อวันที่ ๑ พฤษภาคม ๒๔๔๖ มีหลวงบำเน็จวรญาณ เป็นอาจารย์ใหญ่''',
                            textAlign: TextAlign.justify,
                          ),
                          SizedBox(height: 30),
                          Text(
                            'โรงเรียนฝึกหัดอาจารย์บ้านสมเด็จเจ้าพระยา',
                            style:
                                TextStyle(fontSize: 22.0, color: Colors.purple),
                          ),
                          SizedBox(height: 10),
                          Text(
                            '''\t\t\t\t\t\t\t\t\tการจัดการศึกษาฝึกหัดครูระยะนั้นได้ขยายตัวออกไปต่างจังหวัดมากขึ้นจึงทำให้ความจำเป็นที่จะส่งนักเรียนมาเรียนในกรุงเทพฯ ที่บ้านสมเด็จเจ้าพระยาลดน้อยลง ทางราชการเห็นว่าการฝึกหัดอาจารย์ที่มีอยู่เดิมจะให้ได้ประโยชน์อย่างสูงควรจัดเป็นโรงเรียนประจำจึงให้ย้ายโรงเรียนฝึกหัดอาจารย์เทพศิรินทร์ซึ่งเป็นนักเรียนกลางวันมาอยู่ที่โรงเรียนฝึกหัดครูฝั่งตะวันตกแล้วเรียกชื่อใหม่ว่า “โรงเรียนฝึกหัดอาจารย์ฝั่งตะวันตก” เมื่อ พ.ศ.๒๔๙๙ ขุนวิเทศดรุณกิจเป็นอาจารย์ใหญ่ และต่อมาเรียกว่า “โรงเรียนฝึกหัดอาจารย์บ้านสมเด็จเจ้าพระยา''',
                            textAlign: TextAlign.justify,
                          ),
                          SizedBox(height: 20),
                          Text(
                            '''\t\t\t\t\t\t\t\t\tโรงเรียนมัธยมบ้านสมเด็จเจ้าพระยาเป็นโรงเรียนที่มีชื่อเสียงมาตั้งแต่อดีต\n\t\t\t\t\t\t\t\t\tสีประจำโรงเรียนคือ ม่วงและขาว อักษรย่อของโรงเรียนคือ บ.ส. มีคติพจน์ประจำโรงเรียนคือ “สจฺจํ เว อมตา วาจา”  และตราประจำโรงเรียนคือ รูปเสมาสุริยมณฑล ''',
                            textAlign: TextAlign.justify,
                            style:
                                TextStyle(fontSize: 15.0, color: Colors.purple),
                          ),
                          SizedBox(height: 15),
                          Text(
                            '''      เพื่อเป็นเกียรติแด่ส่มเด็จเจ้าพระยาบรมมหาศรีสุริยวงศ์ สัญลักษณ์ที่กล่าวมานี้เป็นรากฐานสำคัญของสถาบันราชภัฏบ้านสมเด็จเจ้าพระยามาจนถึงปัจจุบันเมื่อ พ.ศ. ๒๔๗๓ ทางราชการได้สร้างสะพานปฐมบรมราชานุสรณ์ (สะพานพุทธ) และได้ตัดถนนผ่านโรงเรียนมัธยมบ้านสมเด็จเจ้าพระยา สถานที่นี้จึงถูกรื้อถอนไม่สามารถทำเป็นโรงเรียนได้อีกต่อไปพระยาวิเศษศุภวัตร์ซึ่งเป็นอาจารย์ใหญ่โรงเรียนมัธยมบ้านสมเด็จเจ้าพระยาอยู่ในสมัยนั้นได้เจรจาผ่านกระทรวงธรรมการเพื่อขอแลกเปลี่ยนสถานที่กับโรงเรียนศึกษานารีซึ่งเป็นโรงเรียนขนาดเล็กและมีนักเรียนจำนวนน้อย ดังนั้นสถานที่ของโรงเรียนศึกษานารีเดิม จึงก่อสร้างเป็นโรงเรียนมัธยมบ้านสมเด็จเจ้าพระยา และกระทรวงพระคลังมหาสมบัติิยังได้มอบที่ดินบริเวณตำบลบางไส้ไก่ และตอนใต้ของโรงเรียนศึกษานารีเดิมเพื่อสร้างหอนอนและห้องเรียน และได้ย้ายนักเรียนมาอยู่ ณ ที่แห่งใหม่นี้ ตั้งแต่พ.ศ.๒๔๗๕  เป็นต้นไป ซึ่งเป็นสถานที่ของสถาบันราชภัฏบ้านสมเด็เจ้าพระยาในปัจจุบันขณะนั้นมีการศึกษาถึงชั้นมัธยมตอนปลาย (ม.๗ -ม.๘) 
            
            ใน พ.ศ.๒๔๘๔ กระทรวงศึกษาธิการมีนโยบายผลิตครูมากขึ้น จึงให้เปิดสอนแผนกฝึกหัดครูอีกแผนกหนึ่งมีชื่อเรียกว่า “โรงเรียนฝึกหัดครูบ้านสมเด็จเจ้าพระยา” คู่กับโรงเรียนมัธยมบ้านสมเด็จเจ้าพระยาแผนกฝึกหัดครูแห่งนี้เปิดรับนักเรียนทุนของจังหวัดที่สำเร็จการศึกษาชั้นมัธยมศึกษาปีที่ ๖ และได้เปิดสอนหลักสูตรประโยคครูประถม  (ป.ป.)  เป็นโรงเรียนประจำต่อมาใน พ.ศ.๒๔๙๙ ได้ยุบหลักสูตรดังกล่าวและเปิดสอนหลักสูตร ประกาศนียบัตรวิชาการศึกษา และหลักสูตรประกาศนียบัตรวิชาการศึกษาชั้นสูง''',
                            textAlign: TextAlign.justify,
                          ),
                          SizedBox(height: 20),
                          Text(
                            'พ.ศ.๒๕๐๑',
                            style:
                                TextStyle(fontSize: 22.0, color: Colors.purple),
                          ),
                          Text(
                            '''\t\t\t\t\t\t\tพ.ศ.๒๕๐๑ โรงเรียนฝึกหัดครูบ้านสมเด็จเจ้าพระยาได้ยกฐานะเป็นวิทยาลัยครูบ้านสมเด็จเจ้าพระยาและโรงเรียนมัธยม ศึกษาบ้านสมเด็จเจ้าพระยาได้เปลี่ยนชื่อเป็นโรงเรียนสาธิตวิทยาลัยครูบ้านสมเด็จเจ้าพระยาวิทยาลัยครูบ้านสมเด็จเจ้าพระยาได้ขยายการจัดการศึกษาเพื่อผลิตครูมาเป็นลำดับ 
                            
            ใน พ.ศ.๒๕๑๖ ได้เปิดสอนในระดับปริญญาตรี หลักสูตรประโยคอุดมศึกษา ต่อมาในปี พ.ศ.๒๕๑๘ กระทรวงศึกษาธิการได้ประกาศใช้พระราชบัญญัติวิทยาลัยครู วิทยาลัยครูบ้านสมเด็จเจ้าพระยา จึงได้เปิดสอนระดับปริญญาตรี สาขาวิชาการศึกษา ครุศาสตรบัณฑิต (ค.บ.) จนกระทั่ง 
            พ.ศ.๒๕๒๗ จึงได้เปิดสอนระดับปริญญาตรี สาขาวิชาการอื่น ๆ เพิ่มขึ้น ได้แก่ 
            
            - สาขาวิชาวิทยาศาสตร์ และสาขาวิชาศิลปศาสตร์ และยังได้เปิดระดับ อนุปริญญา หลักสูตร ๒ ปี นับเป็นการขยายการศึกษาในระดับอุดมศึกษาอย่างกว้างขวาง ในปีเดียวกันนี้ วิทยาลัยครูบ้านสมเด็จเจ้าะพระยาได้รวมกลุ่มกับวิทยาลัยครูกลุ่มนครหลวง ๖ แห่ง''',
                            textAlign: TextAlign.justify,
                          ),
                          SizedBox(height: 20),
                          Text(
                            '''วิทยาลัยครูบ้านสมเด็จเจ้าพระยา\nสหวิทยาลัยรัตนโกสินทร์''',
                            style:
                                TextStyle(fontSize: 22.0, color: Colors.purple),
                          ),
                          SizedBox(height: 10),
                          Text(
                            '''\t\t\t\t\t\t\t\tเรียกชื่อว่า\t\t\t“วิทยาลัยครูบ้านสมเด็จเจ้าพระยา สหวิทยาลัยรัตนโกสินทร์” วันที่ ๑๔ กุมภาพันธ์ พ.ศ.๒๕๓๕ พระบาทสมเด็จพระเจ้าอยู่หัว ทรงพระกรุณาโปรดเกล้าฯ พระราชทานชื่อ “สถาบันราชภัฏ” เป็นชื่อสถาบันการศึกษาในกรมการฝึกหัดครู กระทรวงศึกษาธิการ แทนชื่อ “วิทยาลัยครู” วิทยาลัยครูบ้านสมเด็จเจ้าพระยาจึงได้รับพระราชทาน นามใหม่ว่า “สถาบันราชภัฏบ้านสมเด็จเจ้าพระยา” และจากพระราชบัญญัติสถาบันราชภัฏ พ.ศ.๒๕๓๘  สถาบันราชภัฏบ้านสมเด็จเจ้าพระยาสามารถจัดการศึกษาในระดับปริญญาตรี ปริญญาโท และปริญญาเอกในสาขาวิชาต่าง ๆ ได้ นับได้ว่า สถาบันราชภัฏบ้านสมเด็จเจ้าพระยา เป็นสถาบันที่มีเกียรติประวัติดีงามมาโดยตลอดและเป็นความภาคภูมิใจของนักศึกษาทุกคนที่ได้สำเร็จการศึกษาจากสถาบันแห่งนี้''',
                            textAlign: TextAlign.justify,
                          ),
                          SizedBox(height: 20),
                        ],
                      ),
                    ),
                  ],
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
