import 'package:flutter/material.dart';

class HistoryPag2 extends StatefulWidget {
  @override
  _HistoryPag2State createState() => _HistoryPag2State();
}

class _HistoryPag2State extends State<HistoryPag2> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      // appBar: AppBar(
      //   toolbarHeight: 40,
      //     backgroundColor: Colors.purple,
      //     leading: IconButton(
      //       onPressed: () {
      //         Navigator.of(context).pop();
      //       },
      //       icon: Icon(Icons.arrow_back),
      //     ),
      //     title: Text(
      //       'ประวัติ',
      //     )),
      appBar: AppBar(
          backgroundColor: Colors.purple[50],
          title: Text("ประวัติสมเด็จเจ้าพระยาฯ",style: TextStyle(color: Colors.black),),
          titleSpacing: 00.0,
          centerTitle: true,
          toolbarHeight: 40,
          elevation: 0.00,
          automaticallyImplyLeading: false,
        ),
      body: Container(
        child: Column(
          children: <Widget>[
            Image.asset(
              'images/BSRU1-2.jpg',
              width: 900,
            ),
            Expanded(
              child: SingleChildScrollView(
                child: Column(
                  children: [
                    Container(
                      padding: EdgeInsets.all(20),
                      decoration: BoxDecoration(
                        color: Colors.purple[50],
                      ),
                      child: Column(
                        crossAxisAlignment: CrossAxisAlignment.start,
                        children: [
                          Text(
                            'สมเด็จเจ้าพระยาบรมมหาศรีสุริยวงศ์ (ช่วง บุนนาค)',
                            style:
                                TextStyle(fontSize: 22.0, color: Colors.purple),
                          ),
                          SizedBox(height: 10),
                          Text(
                            '''     เป็นมหาบุรุษของไทยที่สร้างคุณประโยชน์แก่ประเทศชาติอย่างใหญ่หลวงท่านเป็นศูนย์รวมจิตใจของทุกคนในสถาบันราชภัฏบ้านสมเด็จเจ้าพระยา และชุมชนใกล้เคียง เนื่องจากที่ตั้งของสถาบันราชภัฏบ้านสมเด็จเจ้าพระยา และบริเวณโดยรอบเคยเป็นจวนและที่ดินของท่านมาก่อน ทุก ๆ คนในสถาบันราชภัฏแห่งนี้จึงเคารพเทิดทูนท่านโดยขนานนามท่านว่า “เจ้าพ่อ” และเรียกตนเองว่า “ลูกสุริยะ” เนื่องจากท่านได้รับพระราชทานตรามหาสุริยมณฑลจากพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว ซึ่งเป็นตราประจำตัวและยึดถือเป็นสัญลักษณ์แทนตัวท่านมาโดยตลอด ''',
                            textAlign: TextAlign.justify,
                          ),
                          SizedBox(height: 10),
                          Text(
                            ' สมเด็จเจ้าพระยาบรมมหาศรีสุริยวงศ์เป็นบุตรคนใหญ่ของสมเด็จพระยาบรมมหาประยูรวงศ์ (ดิศ บุนนาค) และท่านผู้หญิงจัน ',
                            style:
                                TextStyle(fontSize: 18.0, color: Colors.purple),
                          ),
                          SizedBox(height: 10),
                          Text(
                            '''       เกิดในตอนปลายรัชกาลพระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกมหาราช เมื่อวันที่ ๒๓ ธันวาคม พ.ศ.๒๓๕๑ มีพี่น้องร่วมบิดามารดาเดียวกันรวม ๙ คน บรรพบุรุษของตระกูลบุนนาคเป็นเสนาบดีคนสำคัญ มาตั้งแต่สมัยอยุธยา และได้รับราชการแผ่นดินสืบทอดต่อกันมา สมเด็จเจ้าพระยาบรมมหาศรีสุริยวงศ์ ได้รับการศึกษาและฝึกฝนวิชาการต่าง ๆ เป็นอย่างดี เนื่องจากบิดาของท่านเป็นเจ้าพระยาพระคลังเสนาบดีที่ว่าการต่างประเทศและว่าการปกครองหัวเมืองชายฝั่งทะเลมาก่อน สมเด็จเจ้าพระยาบรมมหาศรีสุริยวงศ์มีความสนใจในภาษาอังกฤษ สามารถพูด และอ่านตำราภาษาอังกฤษในสมัยนั้นได้อย่างคล่องแคล่ว ท่านได้คบหากับชาวตะวันตก ที่เข้ามาในประเทศไทยในสมัยนั้น โดยเฉพาะหมอบรัดเลย์ ท่านยังเป็นบุคคลสำคัญในการเจรจาและทำสัญญากับชาติตะวันตก ที่เข้ามาติดต่อกับไทยในสมัยรัชกาลที่ ๓ และรัชกาลที่ ๔ โดยตลอด นอกจากนี้ยังมีความสามารถ ในการต่อเรือแบบฝรั่ง จนสามารถต่อเรือกำปั่นขนาดใหญ่เป็นจำนวนหลายลำท่านยังมีความสนใจในความรู้อื่น ๆ เช่น วรรณคดี การค้าการปกครอง เป็นต้น''',
                            textAlign: TextAlign.justify,
                          ),
                          SizedBox(height: 30),
                          Text(
                            ' ในสมัยรัชกาลที่ ๒',
                            style:
                                TextStyle(fontSize: 22.0, color: Colors.purple),
                          ),
                          SizedBox(height: 10),
                          Text(
                            '''       สมเด็จเจ้าพระยาบรมมหาศรีสุริยวงศ์ได้ถวายตัวเป็นมหาดเล็ก ในสมัยรัชกาลที่ ๒ และรับราชการมาโดยตลอดจนถึงสมัยรัชกาลที่ ๕ มีตำแหน่ง ราชกาลในระดับสูงคือ อัครมหาเสนาบดีที่สมุหกลาโหม ในสมัยรัชกาลที่ ๔ และดำรงตำแหน่งผู้สำเร็จราชการ แผ่นดินเมื่อครั้งรัชกาลที่ ๕ ยังทรงพระเยาว์ ภายหลังจากที่ลาออกจากราชกาลในบั้นปลายชีวิต ท่านยังได้รับแต่งตั้งให้เป็นที่ปรึกษาราชการแผ่นดินจนถึงแก่พิราลัย นับเป็นมหาบุรุษคนสำคัญ ของประเทศชาติที่ประกอบคุณงามความดีจนเป็นที่ประจักษ์แก่คนทั้งปวง ดังบันทึกของ เซอร์จอห์น เบาวริ่ง ''',
                            textAlign: TextAlign.justify,
                          ),
                          SizedBox(height: 20),
                          Text(
                            '''       ทูตอังกฤษที่เข้ามาติดต่อกับไทยในสมัยรัชกาลที่ ๔ ซึ่งกล่าวไว้ว่า “เจ้าพระยาศรีสุริยวงศ์คนนี้ ถ้าไม่เป็นคนเจ้ามารยา หรือคนรักบ้านเมืองของตนก็ตาม ต้องยอมรับว่าฉลาดล่วงรู้การล้ำคนทั้งหลายที่เราได้พบในที่นี้ ทั้งมีกริยาอัชฌาสัย อย่างผู้ดี และรู้จักพูดจาเหมาะแก่การ” 
      
      พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัวทรงตระหนักพระทัย และ ยกย่องเกียรติคุณของท่านว่า “ครั้นถึงราชกาลปัจจุบัน ได้รับตำแหน่งผู้สำเร็จราชการแผ่นดิน ฉลองพระเดชพระคุณโดยอัธยาศัย เที่ยงธรรม ซื่อตรงมิได้แลเกรงผู้ใด จะว่ากล่าวตัดสินการสิ่งใดจะเป็นคุณประโยชน์โดยทั่วกัน และเป็นแบบอย่างต่อไปภายหน้า สิ้นกาลนาน” ''',
                            textAlign: TextAlign.justify,
                            style:
                                TextStyle(fontSize: 15.0, color: Colors.purple),
                          ),
                          SizedBox(height: 15),
                          Text(
                            '''      สมเด็จเจ้าพระยาบรมมหาศรีสุริยวงศ์สมรสกับท่านผู้หญิงกลิ่น มีบุตรและธิดารวมกัน ๔ คน ในบั้นปลายชีวิต ของท่านมักจะพักอยู่ที่เมืองราชบุรี และถึงแก่พิราลัยด้วยโรคลมบนเรือที่ปากคลองกระทุ่มแบน ราชบุรี รวมอายุ ๗๔ ปี เมื่อวันที่ ๑๙ มกราคม พ.ศ.๒๔๒๕ สถาบันราชภัฏบ้านสมเด็จเจ้าพระยาจึงได้จัดพิธีรำลึกถึงท่านในวันที่ ๑๙ มกราคม ของทุกปี เรียกว่า วันคล้ายวันพิราลัย สมเด็จเจ้าพระยาบรมมหาศรีสุริยวงศ์ จึงเป็นศูนย์รวมของทุกคนในสถาบันแห่งนี้ที่จะประกอบคุณความดีทั้งปวง และมีความสามัคคีต่อกันเพื่อเทิดทูนเกียรติของท่านตลอดไป''',
                            textAlign: TextAlign.justify,
                          ),
                          SizedBox(height: 20),
                          Divider(color: Colors.black38),
                          Text(
                            ''' **ในวาระครบ ๑๕๐ ปี ของการเป็นผู้สำเร็จราชการแผ่นดินของสมเด็จเจ้าพระยาบรมมหาศรีสุริยวงศ์ ในพุทธศักราช ๒๕๖๑ มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยาได้ดำเนินการเสนอชื่อ สมเด็จเจ้าพระยาบรมมหาศรีสุริยวงศ์ (ช่วง บุนนาค) ตามหลักเกณฑ์การเสนอชื่อบุคคลสำคัญและเหตุการณ์สำคัญทางประวัติศาสตร์ผ่านกระทรวงศึกษาธิการเพื่อเสนอชื่อต่อองค์การเพื่อการศึกษา วิทยาศาสตร์ และวัฒนธรรมแห่งสหประชาชาติ (ยูเนสโก) เพื่อประกาศยกย่องเป็นบุคคลสำคัญของโลกต่อไป''',
                            textAlign: TextAlign.justify,
                            style: TextStyle(
                                fontSize: 14.0, color: Colors.purple[900]),
                          ),
                        ],
                      ),
                    ),
                  ],
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
